Revit 2018 API
RuledSurface Methods
The RuledSurface type exposes the following members.
Methods
Name | Description
Create(Curve, Curve)
 Creates a Surface object coincident with the ruled surface joining two bounded generating curves.
Create(Curve, XYZ)
 Creates a Surface object coincident with the ruled surface joining a bounded generating curve to a point.
Dispose |  (Inherited from Surface.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFirstProfileCurve
 Returns a copy of the first profile curve if it is set.
GetFirstProfilePoint
 If a point was used to define the first profile, returns a copy of that point.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSecondProfileCurve
 Returns a copy of the second profile curve if it is set.
GetSecondProfilePoint
 If a point was used to define the second profile, returns a copy of that point.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
HasFirstProfilePoint
 Checks if a point was used to define the first profile.
HasSecondProfilePoint
 Checks if a point was used to define the second profile.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
RuledSurface Class
Autodesk.Revit.DB Namespace